## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 24 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                           NAME                                                           |
|--------|--------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_stream.ai_answers_stream`                                                                            |
|        | `aws_security_group.ecs_tasks`                                                                                           |
|        | `aws_security_group_rule.database_ingress_ecs`                                                                           |
|        | `aws_security_group_rule.ecs_egress_database`                                                                            |
|        | `module.ai_answers.aws_appautoscaling_policy.this[&quot;cpu&quot;]`                                                                |
|        | `module.ai_answers.aws_appautoscaling_policy.this[&quot;memory&quot;]`                                                             |
|        | `module.ai_answers.aws_appautoscaling_target.this[0]`                                                                    |
|        | `module.ai_answers.aws_cloudwatch_log_group.this`                                                                        |
|        | `module.ai_answers.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0]`                                    |
|        | `module.ai_answers.aws_ecs_cluster.this[0]`                                                                              |
|        | `module.ai_answers.aws_ecs_cluster_capacity_providers.this[0]`                                                           |
|        | `module.ai_answers.aws_ecs_service.this`                                                                                 |
|        | `module.ai_answers.aws_ecs_task_definition.this`                                                                         |
|        | `module.ai_answers.aws_iam_policy.this_task_exec`                                                                        |
|        | `module.ai_answers.aws_iam_role.this_task`                                                                               |
|        | `module.ai_answers.aws_iam_role.this_task_exec`                                                                          |
|        | `module.ai_answers.aws_iam_role_policy_attachment.this_task_exec`                                                        |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth`                               |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/ai-answers/actions/runs/13268976067).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m17:37:40.856[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m17:37:40.856[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= read (data resources)
[0;90m17:37:40.856[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m17:37:40.856[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_cloudwatch_log_stream.ai_answers_stream will be created
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_stream" "ai_answers_stream" {
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn            = (known after apply)
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_name = "/aws/ecs/ai-answers-cluster"
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name           = "ai-answers-log-stream"
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.ecs_tasks will be created
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_security_group" "ecs_tasks" {
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = "Allow inbound and outbound traffic for AI Answers"
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress                 = [
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + cidr_blocks      = [
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + "0.0.0.0/0",
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + description      = "Allow ecs security group to send all traffic"
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + from_port        = 0
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + ipv6_cidr_blocks = []
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + prefix_list_ids  = []
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + protocol         = "-1"
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + security_groups  = []
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + self             = false
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + to_port          = 0
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m17:37:40.857[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress                = [
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + cidr_blocks      = []
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + description      = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + from_port        = 3001
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + ipv6_cidr_blocks = []
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + prefix_list_ids  = []
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + protocol         = "tcp"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + security_groups  = [
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + "sg-08e35f1019824d56a",
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + self             = false
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + to_port          = 3001
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                   = "ai-answers-security-group"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revoke_rules_on_delete = false
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = "vpc-0659c9b2d7046368f"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group_rule.database_ingress_ecs will be created
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_security_group_rule" "database_ingress_ecs" {
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description              = "Allow DocumentDB cluster to receive requests from ECS"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + from_port                = 27017
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                       = (known after apply)
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + protocol                 = "tcp"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_id        = "sg-04966047bf236b850"
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_rule_id   = (known after apply)
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + self                     = false
[0;90m17:37:40.858[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_security_group_id = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + to_port                  = 27017
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type                     = "ingress"
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group_rule.ecs_egress_database will be created
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_security_group_rule" "ecs_egress_database" {
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description              = "Allow ECS to talk to the DocumentDB cluster"
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + from_port                = 27017
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                       = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + protocol                 = "tcp"
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_id        = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_group_rule_id   = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + self                     = false
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_security_group_id = "sg-04966047bf236b850"
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + to_port                  = 27017
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type                     = "egress"
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.data.aws_ecs_task_definition.this_latest will be read during apply
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (depends on a resource or a module with changes pending)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_ecs_task_definition" "this_latest" {
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                      = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn_without_revision     = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + container_definitions    = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cpu                      = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_fault_injection   = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ephemeral_storage        = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + execution_role_arn       = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + family                   = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                       = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inference_accelerator    = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipc_mode                 = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + memory                   = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_mode             = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + pid_mode                 = (known after apply)
[0;90m17:37:40.859[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + placement_constraints    = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + proxy_configuration      = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + requires_compatibilities = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revision                 = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + runtime_platform         = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + status                   = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + task_definition          = "ai-answers-task"
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + task_role_arn            = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + volume                   = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (config refers to values not yet known)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_iam_policy_document" "this_task_exec_combined" {
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                      = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + json                    = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + minified_json           = (known after apply)
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_policy_documents = [
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + jsonencode(
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                {
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + Statement = [
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + {
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Action   = [
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                              + "ecr:GetDownloadUrlForLayer",
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                              + "ecr:GetAuthorizationToken",
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                              + "ecr:BatchGetImage",
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                              + "ecr:BatchCheckLayerAvailability",
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                            ]
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Effect   = "Allow"
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Resource = "*"
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        },
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    ]
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + Version   = "2012-10-17"
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                }
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ),
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + (known after apply),
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.860[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (config refers to values not yet known)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_iam_policy_document" "this_task_exec_logs" {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id            = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + json          = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + minified_json = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + statement {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + actions   = [
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:DescribeLogGroups",
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + effect    = "Allow"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + resources = [
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "*",
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + statement {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + actions   = [
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:CreateLogStream",
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:DescribeLogStreams",
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:PutLogEvents",
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + effect    = "Allow"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + resources = [
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + (known after apply),
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_appautoscaling_policy.this["cpu"] will be created
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_appautoscaling_policy" "this" {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + alarm_arns         = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                 = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name               = "cpu"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_type        = "TargetTrackingScaling"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + resource_id        = "service/ai-answers-cluster/ai-answers-app-service"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + scalable_dimension = "ecs:service:DesiredCount"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + service_namespace  = "ecs"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + target_tracking_scaling_policy_configuration {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + disable_scale_in   = false
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + scale_in_cooldown  = 60
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + scale_out_cooldown = 60
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + target_value       = 60
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + predefined_metric_specification {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_appautoscaling_policy.this["memory"] will be created
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_appautoscaling_policy" "this" {
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + alarm_arns         = (known after apply)
[0;90m17:37:40.861[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                 = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name               = "memory"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy_type        = "TargetTrackingScaling"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + resource_id        = "service/ai-answers-cluster/ai-answers-app-service"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + scalable_dimension = "ecs:service:DesiredCount"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + service_namespace  = "ecs"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + target_tracking_scaling_policy_configuration {
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + disable_scale_in   = false
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + scale_in_cooldown  = 60
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + scale_out_cooldown = 60
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + target_value       = 60
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + predefined_metric_specification {
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_appautoscaling_target.this[0] will be created
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_appautoscaling_target" "this" {
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                 = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_capacity       = 2
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + min_capacity       = 1
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + resource_id        = "service/ai-answers-cluster/ai-answers-app-service"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role_arn           = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + scalable_dimension = "ecs:service:DesiredCount"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + service_namespace  = "ecs"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags               = {
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all           = {
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + suspended_state (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_cloudwatch_log_group.this will be created
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_group" "this" {
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn               = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_class   = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name              = "/aws/ecs/ai-answers-cluster/ai-answers-app-service"
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix       = (known after apply)
[0;90m17:37:40.862[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + retention_in_days = 30
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy      = false
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags              = {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all          = {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0] will be created
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_subscription_filter" "this_sentinel_forwarder" {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + destination_arn = (known after apply)
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + distribution    = "Random"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + filter_pattern  = "[w1=\"*\"]"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id              = (known after apply)
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_name  = "/aws/ecs/ai-answers-cluster/ai-answers-app-service"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name            = "All cluster logs"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role_arn        = (known after apply)
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_ecs_cluster.this[0] will be created
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ecs_cluster" "this" {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn      = (known after apply)
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id       = (known after apply)
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name     = "ai-answers-cluster"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags     = {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all = {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + setting {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + name  = "containerInsights"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + value = "enabled"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # module.ai_answers.aws_ecs_cluster_capacity_providers.this[0] will be created
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ecs_cluster_capacity_providers" "this" {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + capacity_providers = [
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "FARGATE",
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_name       = "ai-answers-cluster"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                 = (known after apply)
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_capacity_provider_strategy {
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + base              = 1
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + capacity_provider = "FARGATE"
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + weight            = 1
[0;90m17:37:40.863[0m [0;37mSTDOUT[0m [0;36mterraform: [0m       ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
